In [1]:
import pandas as pd

In [21]:
l1 = [{'name':'john', 'job':'teacher'},
     {'name':'Nate', 'job':'student'},
     {'name':'Fred', 'job':'develpoer'}]

l2 = [{'name':'Ed', 'job':'dentist'},
     {'name':'Jack', 'job':'farmer'},
     {'name':'Ted', 'job':'designer'}]

l3 = [{'name':'john', 'job':'teacher'},
     {'name':'Nate', 'job':'student'},
     {'name':'Fred', 'job':'develpoer'}]

l4 = [{'age':25, 'country':'U.S'},
     {'age':30, 'country':'U.K'},
     {'age':45, 'country':'korea'}]

In [22]:
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [23]:
df1

   name        job
0  john    teacher
1  Nate    student
2  Fred  develpoer

In [24]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [25]:
result = pd.concat([df1,df2], ignore_index=True)

In [26]:
result

   name        job
0  john    teacher
1  Nate    student
2  Fred  develpoer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [27]:
result = df1.append(df2, ignore_index=True)

In [28]:
result

   name        job
0  john    teacher
1  Nate    student
2  Fred  develpoer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [29]:
df1 = pd.DataFrame(l3, columns = ['name', 'job'])
df2 = pd.DataFrame(l4, columns = ['age', 'country'])

In [30]:
df1

   name        job
0  john    teacher
1  Nate    student
2  Fred  develpoer

In [31]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   korea

In [32]:
result = pd.concat([df1, df2], axis=1, ignore_index=True)

In [33]:
result

      0          1   2      3
0  john    teacher  25    U.S
1  Nate    student  30    U.K
2  Fred  develpoer  45  korea

In [34]:
ladel = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [37]:
comparison = pd.DataFrame({'ladel': ladel, 'predicrion':prediction})

In [38]:
comparison

   ladel  predicrion
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4